rottenpotatoes/app/controllers/movies_controller.rb

  def directorsearch
    @movie = Movie.find(params[:id])
    if @movie.director and not @movie.director.empty?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]